{
  "Nicholas-L-Caceres": {
    "name": "Aspiring Jack of All Trades",
    "desc": "\t Hi there! My name is Nicholas Caceres, and thanks for coming to my portfolio site! Here you'll find my small endeavors into the Software Development world ranging from front-end to mobile and even lower-level GUI programming (tab coming soon). \n \n \t As a graduate of USC, I started and finished as a Biology major but picked up a love of Chinese language and culture, earning an East Asian Languages and Cultures minor in Mandarin as well as what I thought would just be a hobby of programming by taking on a Mobile App Development minor. Over time and as I progressed through each Computer science class though, I realized more and more that software engineering should play a bigger part in my life than just a fun hobby. On one hand I still loved Biology in particular Neuroscience and genetics, but on the other, I came to the conclusion that the future of Biology lies in the incredible new technology being developed to gain a deeper understanding of it. If I wanted to join those taking strides in not only academia but most importantly, making a difference for human health, then software development would be just as big of a part of my education and work life. After graduating from USC, I committed myself to expanding my skill set in modern Software Development while helping my family and working. If I thought balancing my education, work and family was difficult in college, I found it was even tougher after finishing, when life can throw you curveballs even quicker. Despite any shortcomings and a lengthier timeline than expected, I feel proud looking back at the number of projects I've completed and the number of topics I've covered in both the Software development world and the world outside of it, including Healthcare, Marvel Comics, Auto Sales and more. No matter what field I work in, bringing a satisfying experience to any person who comes into contact with my work is my ultimate end goal. \n \n \t Aside from software development, I've been a waiter, pizza and package delivery guy, and even a property manager. Having worked in these other fields has shaped my mentality immensely, certainly contributing to my desire to always leave clients, family or friends content. Besides refining the keen eye on user experience and satisfaction that USC taught me, I think trying and working in different lines of work has helped my confidence, proving to myself I'm capable of adapting and providing excellent service in each. Moreover, it's given me a deeper insight into the process and needs of different companies, imparting the importance of taking the time to truly understand your work environment, client needs, and coworker synergy. \n \n \t While there's always time for work, there does come a time for play, and what would a person be without hobbies. Having played guitar for over half my life now, my guitar is my 2nd sidekick after my little puppy, Isabella. Whether doing gigs in high school and college, or kicking back with my girlfriend to watch the Avengers, having my guitar in my hand just leaves me smiling. I must admit, though, having my girlfriend Kat by my side helps, especially on our many adventures to the Disney resorts as passholders to Disneyland as well as the Six Flags parks. Zipping from park to park isn't always the easiest with LA traffic but alongside one of my best friends, Edwin, I got a motorcycle shortly after earning my license and turning 20. Thankfully, I've have been avoiding traffic as much as possible ever since. Together and after plenty of mistakes, misplaced parts, and messes cleaned up, we've learned plenty of automotive mechanics, and this year I was confident enough to pull apart my exhaust, handlebars and brakes for repairs, having lived to tell the tale with only a couple bruises and small cuts. And after all that work, there isn't much better out there than grabbing a good meal and a movie with my friends. It's a passtime I've kept since high school with friends I've kept since elementary and hope to for the rest of my life. \n \n \t With my goals in mind and my family and friends always backing me up, I'm fortunate enough to have had the opportunity to learn at USC and had the resources presented for me to accomplish any goals I set my mind to. As a 25 year old soon to be turning 26, I feel prepared, ready and eager for wherever life takes me next, carrying the torch and taking it as far as I can go. Fight On!",
    "images": [
      {
        "src": "https://via.placeholder.com/350.png?text=Project",
        "alt": "Temporary project placeholder"
      }
    ],
    "github": "https://github.com/NLCaceres"
  }
}
